"""2. Дано два списки чисел. Порахуйте, скільки різних чисел міститься як у першому списку, і у другому оночасно.
-PS: Різних чисел - мається на увазі що усі однакові елементи повинні бути представленні в одному екземплярі
 (приклад: 3 однаковиі числа мають бути пораховані як 1 елемент)"""

dct = {}
a = [2, 4, 3, 5, 6, 7, 3, 5, 9, 5, 6, 9]
b = [2, 5, 6, 3, 4, 5, 9, 2, 5, 9, 3, 5, 7, 0]
set_a = set(a)
set_b = set(b)
print('Кількість різних чисел в списку:', len(set_a.union(set_b)))
print('Кількість різних чисел в списку:', len(set_a | set_b))