poem = """Любіть Україну, як сонце, любіть,

як вітер, і трави, і води…

В годину щасливу і в радості мить,

любіть у годину негоди.

Любіть Україну у сні й наяву,

вишневу свою Україну,

красу її, вічно живу і нову,

і мову її солов’їну.

Між братніх народів, мов садом рясним,

сіяє вона над віками…

Любіть Україну всім серцем своїм

і всіми своїми ділами.

Для нас вона в світі єдина, одна

в просторів солодкому чарі…

Вона у зірках, і у вербах вона,

і в кожному серця ударі,

у квітці, в пташині, в електровогнях,

у пісні у кожній, у думі,

в дитячий усмішці, в дівочих очах

і в стягів багряному шумі…"""

poem = poem.replace(',',
                    '').replace('.',
                                     '').replace('\n',
                                                 ' ').replace('…',
                                                              '')
poem = poem.lower()
poem_lst = poem.split(' ')

new_dct = {}
for i in poem_lst:
    new_dct.setdefault(i, 0)
    new_dct[i] += 1
del new_dct['']
print(new_dct)

print(min(new_dct, key=new_dct.get))
print(max(new_dct, key=new_dct.get))