import itertools

"""Створимо список перевірок при порівнні
суми двох чисел зі списку з другим параметром"""
bool_lst = []
"Задаємо на вхід 2 параметри - довільний список та число"
def check_sum(a, b=[]):
"""Використовуєму функцію для перебирання
    комбінацій двох чисел без суми самого себе"""
    for el in itertools.combinations(b, 2):
"Для перевірки можливих комбінацій сум чисел зі списку з параметром"
        if sum(el) == a:
        "Повертаємо бульове значення як результат пошуку якщо True"
            return True
        else:
            "Повертаємо бульове значення як результат пошуку якщо False"
            return False

check_sum(3, [1, 2, 1])

check_sum(8, [1, 2, 1, 5])